Archiwum/openFoam_MIN/_study_runs/re100Cylinder/v1_u10_d25_h10/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.5e-5;
