Archiwum/openFoam_MIN/_study_runs/re100Cylinder/v1_u10_d25_h10/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  laminar;
