Archiwum/openFoam_MIN/_study_runs/re100Cylinder/v1_u10_d25_h10/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.120000 -0.120000 -0.005000)
    (0.300000 -0.120000 -0.005000)
    (0.300000 0.120000 -0.005000)
    (-0.120000 0.120000 -0.005000)
    (-0.120000 -0.120000 0.005000)
    (0.300000 -0.120000 0.005000)
    (0.300000 0.120000 0.005000)
    (-0.120000 0.120000 0.005000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (140 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
