Archiwum/openFoam_MIN/_study_runs/re100Cylinder/v1_u10_d25_h10/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

readFields      ( U );

expressions
(
    U
    {
        field       U;
        create      no;
        dimensions  [0 1 -1 0 0 0 0];
        expression
        #{ vector
            (
                0.125*(1 + 0.02*tanh((pos().y()-0.0015)/0.003)),
                0.0025*exp(-pow((pos().x()-0.018)/0.012,2) - pow((pos().y()-0.003)/0.006,2)),
                0
            )
        #};
    }
);
